JerrickRowe/stm32-bootloader/projects/STM32F407-OWL/source/main.c
/**
 *******************************************************************************
 * STM32L4 Bootloader
 *******************************************************************************
 * @author Akos Pasztor
 * @file   main.c
 * @brief  Main program
 *	       This file demonstrates the usage of the bootloader.
 *
 * @see    Please refer to README for detailed information.
 *******************************************************************************
 * Copyright (c) 2020 Akos Pasztor.                     https://akospasztor.com
 *******************************************************************************
 */ 

#include "stm32f4xx.h"
#include "stm32f4xx_hal.h"
#include "stm32f4xx_ll_rcc.h"
#include "main.h"
#include "bootloader.h"
#include "tea.h"
#include "ff.h"
#include "led.h"
#include "bsp_WS2812x.h"
#include <assert.h>
#include <stdio.h>
#include <string.h>
#include <ctype.h>

#include "git.h"

#include "testcases.h"

#define DECRYPTION_ENABLED	0


#define DEBUG 1
#if DEBUG
#include <stdio.h>
#define PRINT_RAW(fmt,...)	printf( fmt,##__VA_ARGS__ )
#define PRINT_INF(fmt,...)	printf( fmt"\r\n",##__VA_ARGS__ )
#define PRINT_ERR(fmt,...)	printf( fmt"\r\n",##__VA_ARGS__ )
#else
#define PRINT_RAW(fmt,...)	
#define PRINT_INF(fmt,...)	
#define PRINT_ERR(fmt,...)	
#endif


/* Private variables ---------------------------------------------------------*/
static uint8_t BTNcounter = 0;

#define VER		0

#define REV		1

#define PRJ_STR	"FlyFire-bootloader"

/* External variables --------------------------------------------------------*/
char  SDPath[4] = "SD:"; /* SD logical drive path */
FATFS SDFatFs;   /* File system object for SD logical drive */
FIL   SDFile;    /* File object for SD */
static FIL upgrade_file;

/* Function prototypes -------------------------------------------------------*/
void    Enter_Bootloader(void);
void    SD_DeInit(void);
void    SD_Eject(void);
void    GPIO_Startup(void);
void    Console_Init(void);
void    Console_DeInit(void);
void    GPIO_DeInit(void);
void    SystemClock_Config(void);
void    Error_Handler(void);
void    print(const char* str);

/* Private functions ---------------------------------------------------------*/
const char *months[] = {
	  "Jan", "Feb", "Mar", "Apr", "May", "Jun"
	, "Jul", "Aug", "Sep", "Oct", "Nov", "Dec"
};
void getBuildTimeStr_YYYYMMDDhhss(char *pDes){
	char strDate [] = __DATE__;
	char strTime [] = __TIME__;
	unsigned char i;
	unsigned int month, day, hour, minute, year;

	*(strTime + 2) = 0;
	*(strTime + 5) = 0;
	hour = atoi(strTime);
	
	minute = atoi(strTime+3);
	year = atoi(strDate + 9);
	
	*(strDate + 6) = 0;
	day = atoi(strDate + 4);
	*(strDate + 3) = 0;
	for (i = 0; i < 12; i++){
		if (!strcmp(strDate, months[i])){
			month = i + 1;
			sprintf( pDes, "20%02d%02d%02d%02d%02d", year, month, day, hour, minute );
			return;
		}
	}
}


const char* get_version_string( void ){
	static char str[500];
	print( "\n\n\n\n\n\r" 
		"______  _        ______  _             \r\n"
		"|  ___|| |       |  ___|(_)            \r\n"
		"| |_   | | _   _ | |_    _  _ __   ___ \r\n"
		"|  _|  | || | | ||  _|  | || '__| / _ \\\r\n"
		"| |    | || |_| || |    | || |   |  __/\r\n"
		"\\_|    |_| \\__, |\\_|    |_||_|    \\___|\r\n"
		"            __/ |                      \r\n"
		"           |___/                       \r\n"
	);
	snprintf( str, sizeof(str), "%s-V%d.%d-%s-", PRJ_STR, VER, REV, GIT_COMMIT_HEAD );
	getBuildTimeStr_YYYYMMDDhhss(str+strlen(str));
	return str;
}




/**
  * @brief This function is called to increment  a global variable "uwTick"
  *        used as application time base.
  * @note In the default implementation, this variable is incremented each 1ms
  *       in SysTick ISR.
 * @note This function is declared as __weak to be overwritten in case of other 
  *      implementations in user file.
  * @retval None
  */
static uint32_t tick;
void HAL_IncTick(void)
{
  tick ++;
}

/**
  * @brief Provides a tick value in millisecond.
  * @note This function is declared as __weak to be overwritten in case of other 
  *       implementations in user file.
  * @retval tick value
  */
uint32_t HAL_GetTick(void)
{
  return tick;
}

FRESULT scan_files ( char* path ){       /* Start node to be scanned (***also used as work area***) */
    FRESULT res;
    DIR dir;
    UINT i;
    static FILINFO fno;

    res = f_opendir(&dir, path);                       /* Open the directory */
    if (res == FR_OK) {
        for (;;) {
            res = f_readdir(&dir, &fno);                   /* Read a directory item */
            if (res != FR_OK || fno.fname[0] == 0) break;  /* Break on error or end of dir */
            if (fno.fattrib & AM_DIR) {                    /* It is a directory */
                i = strlen(path);
                sprintf(&path[i], "/%s", fno.fname);
                res = scan_files(path);                    /* Enter the directory */
                if (res != FR_OK) break;
                path[i] = 0;
            } else {                                       /* It is a file. */
                PRINT_RAW("%s/%s\r\n", path, fno.fname);
            }
        }
        f_closedir(&dir);
    }
    return res;
}

int ls( int argc, char** argv ){
    FRESULT  res;
	DIR dir;
	FILINFO fno;
	char path[100] = "SD:";
	int i;
	scan_files( path );
	return 0;
}


int testcase_4 ( void );

void MountFilesystem( void ){
	
	// testcase_4();
	
    PRINT_RAW("Mount SD card and FatFS........");
    FRESULT  res;
    UINT     num;
    uint8_t  i;
    uint8_t  status;
    uint64_t data;
    uint32_t cntr;
    uint32_t addr;
    char     msg[40] = {0x00};
    

    /* Mount SD card */
    res = f_mount(&SDFatFs, (TCHAR const*)SDPath, 1);
    if(res != FR_OK)
    {
        /* f_mount failed */
        PRINT_INF("MNT_FAILED [0x%02X]",res);
        return;
    }
    PRINT_INF("DONE");

}



void Copy_App2_To_App1( void ){
	PRINT_RAW("Copy App2 to App1.");
	
	Bootloader_FlashBegin();
	
	uint32_t cnt = 0;
	
	while( cnt < ((APP2_SIZE+4) / 4 ) ){
		uint32_t data = *(uint32_t *)(APP2_ADDRESS + (cnt*4));
		uint8_t  status;
		status = Bootloader_FlashNextWord(data);
		if( cnt % 9830 == 0 ){
			PRINT_RAW(".");
		}
		cnt ++;
	}
	
	Bootloader_FlashEnd();
	
#if(USE_CHECKSUM)
	// Verify application checksum 
	if(Bootloader_IsApp2ChecksumValid() != BL_OK){
		PRINT_RAW("FAILED");
	}else{
		PRINT_RAW("DONE");
	}
#endif
	PRINT_RAW("\r\n");
}


bool Copy_File_To_App1( FIL* fp ){
	FRESULT res;
	UINT br = 0;
	uint8_t buff[512];
	PRINT_INF("Copy file to App1:");
	PRINT_RAW("  Copy.");
	f_rewind(fp);
	uint32_t scan = 0;
	uint32_t boundary = (APP1_SIZE+4)/512;
	


