JerrickRowe/stm32-bootloader/projects/STM32F407-OWL/source/main.c
	Bootloader_FlashBegin();
	for( scan=0; scan<boundary; scan++ ){
		res = f_read( fp, buff, 512, &br );
		if(res!=FR_OK || br!=512){
			PRINT_ERR( "  f_read error [0x%02X] byte read=%d", res, br );
			Bootloader_FlashEnd();
			return false;
		}
		// Decryption 
	#if DECRYPTION_ENABLED
		btea_decrpyt(buff,TEA_key);
	#endif
		// Copy
		uint32_t cnt = 0;
		for( cnt=0; cnt<512/4; cnt++ ){
			uint32_t data = ((uint32_t*)buff)[cnt];
			uint8_t  status;
			status = Bootloader_FlashNextWord(data);
			if( status != BL_OK ){
				PRINT_RAW("Failed\r\n");
				Bootloader_FlashEnd();
				return false;
			}
		}
		if( scan%64 == 0 ){
			PRINT_RAW( "." );
		}
	}
	Bootloader_FlashEnd();
	PRINT_RAW("Done\r\n");
	return true;
}


bool VerifyUpgradeFile( FIL* fp ){
	FRESULT res;
	UINT br = 0;
	uint8_t buff[512];
	PRINT_INF("Verifying upgrade file:");

	if( f_size( fp ) != APP1_SIZE+4 ){
		PRINT_ERR( "  Incorrect file size" );
		goto ERROR;
	}

    CRC_HandleTypeDef CrcHandle;
    volatile uint32_t calculatedCrc = 0;
    __HAL_RCC_CRC_CLK_ENABLE();
    CrcHandle.Instance                     = CRC;
    CrcHandle.State                        = HAL_CRC_STATE_RESET;
    if(HAL_CRC_Init(&CrcHandle) != HAL_OK){
		PRINT_ERR( "  CRC init error" );
		goto ERROR;
    }

	PRINT_RAW( "  CRC.." );
	f_rewind(fp);
	uint32_t scan = 0;
	uint32_t boundary = (APP1_SIZE+4)/512;
	for( scan=0; scan<boundary; scan++ ){
		res = f_read( fp, buff, 512, &br );
		if(res!=FR_OK || br!=512){
			PRINT_ERR( "  f_read error [0x%02X] byte read=%d", res, br );
			goto ERROR;
		}
		// Decryption 
	#if DECRYPTION_ENABLED
		btea_decrpyt(buff,TEA_key);
	#endif
		// Verification
		if( scan == 0 ){ // First unit
			if( ((*(uint32_t*)buff - RAM_BASE) > RAM_SIZE) ){
				PRINT_ERR( "  Bad MSP[0x%08X]", *(uint32_t*)buff );
				goto ERROR;
			}
			calculatedCrc = HAL_CRC_Accumulate(&CrcHandle, (uint32_t*)buff, 512/4);
		}else if( scan == boundary-1 ){ // Last unit
			calculatedCrc = HAL_CRC_Accumulate(&CrcHandle, (uint32_t*)buff, (512-4)/4);
		}else{
			calculatedCrc = HAL_CRC_Accumulate(&CrcHandle, (uint32_t*)buff, 512/4);
		}
		if( scan%64 == 0 ){
			PRINT_RAW( "." );
		}
	}

    if( *(uint32_t*)&(buff[512-4]) != calculatedCrc ){
		PRINT_ERR( "  CRC failed [0x%08X]", calculatedCrc );
		goto ERROR;
    }
	PRINT_RAW( "Pass\r\n" );

	PRINT_INF( "  %s is verified", UPGRADE_FILENAME );
    return true;
ERROR:
	PRINT_INF( "  %s cannot be used", UPGRADE_FILENAME );
    __HAL_RCC_CRC_FORCE_RESET();
    __HAL_RCC_CRC_RELEASE_RESET();
	return false;
}


bool IsUpgradeFileExists( void ){
	FRESULT res;
	FILINFO fno;
	PRINT_RAW("Finding \"%s\"......", UPGRADE_FILENAME);
	res = f_stat(UPGRADE_FILENAME, &fno);
    if(res != FR_OK){
		PRINT_INF("NOTFOUND");
        return false;
	}
	PRINT_INF("FOUND");
	PRINT_INF("  %s %dbytes"
	,	fno.fname
	,	fno.fsize
	);
	return true;
}


bool IsApp1Jumpable( void ){
	PRINT_RAW("Checking for App 1.............");
    // Check if there is application in user flash area
    if(Bootloader_CheckForApp1() == BL_OK){
#if(USE_CHECKSUM)
		// Verify application checksum 
		if(Bootloader_IsApp1ChecksumValid() != BL_OK){
			PRINT_RAW("BAD\r\n");
			return false;
		}else{
			PRINT_RAW("PASS\r\n");
			return true;
		}
#endif
	}else{
		PRINT_RAW("NOTFOUND\r\n");
		return false;
	}
}


bool UpgradeFromSD( void ){
	FRESULT res;
	FILINFO file_info;
	FILINFO fno;
	
	// PRINT_INF(	"List files:" );
	// ls( 1, "SD:" );
	if( IsUpgradeFileExists() == false ){
		return false;
	}

	PRINT_RAW("Opening \"%s\"......", UPGRADE_FILENAME);
	res = f_open(&upgrade_file, UPGRADE_FILENAME, FA_READ);
	if( res != FR_OK ){
		PRINT_RAW("FAILED\r\n");
		return false;
	}
	PRINT_RAW("DONE\r\n");

	if( VerifyUpgradeFile( &upgrade_file ) == false ){
		return false;
	}
	if( Copy_File_To_App1( &upgrade_file ) == false ){
		return false;
	}

	f_close( &upgrade_file );

	if( IsApp1Jumpable() == false ){
		return false;
	}

	PRINT_RAW("Backing up......", UPGRADE_FILENAME);
	res = f_rename( UPGRADE_FILENAME, BACKUP_FILENAME );
	if( res != FR_OK ){
		PRINT_RAW("FAILED\r\n");
	}
	PRINT_RAW("DONE\r\n");
	PRINT_RAW("Backup filename: %s\r\n", BACKUP_FILENAME);

	return true;
}



/* Main ----------------------------------------------------------------------*/
int main(void)
{
    HAL_Init();
    GPIO_Startup();

	Console_Init();
	
	led_init();
    PRINT_RAW("%s\r\n",get_version_string());

	led_allon();
	
	MountFilesystem();

	// char cwd[50];
	// f_getcwd(cwd,50);
	// PRINT_RAW("Current path: \"%s\"\r\n", cwd);
	
	if( UpgradeFromSD() == true ){
		PRINT_RAW("Launching new app.\r\n");
		// De-initialize bootloader hardware & peripherals
		SD_DeInit();
		GPIO_DeInit();
		// Launch application 
		Bootloader_JumpToApp1();
	}
	
	static bool app1_available = false;
	static bool app2_available = false;

	if( IsApp1Jumpable() == true ){
		app1_available = true;
	}
	
/*
	PRINT_RAW("Checking for App 2.............");
    // Check if there is application in user flash area
    if(Bootloader_CheckForApp2() == BL_OK){
#if(USE_CHECKSUM)
		// Verify application checksum 
		if(Bootloader_IsApp2ChecksumValid() != BL_OK){
			PRINT_RAW("BAD");
		}else{
			PRINT_RAW("PASS");
			app2_available = true;
		}
#endif
	}else{
		PRINT_RAW("NOTFOUND");
	}
	PRINT_RAW("\r\n");
*/
/*
	// Check if backup app are the same.
	bool isApp2TheSameAsApp1 = false;
	if( app1_available && app2_available ){
		PRINT_RAW("Comparing App1 and App2......");
		if( memcmp( APP1_ADDRESS, APP2_ADDRESS, APP2_SIZE ) == 0 ){
			isApp2TheSameAsApp1 = true;
			PRINT_RAW("Same\r\n");
			PRINT_RAW("Launching App 1.\r\n");
			// De-initialize bootloader hardware & peripherals
			SD_DeInit();
			GPIO_DeInit();
			// Launch application 
			Bootloader_JumpToApp1();
		}else{
			PRINT_INF("Different");
			Copy_App2_To_App1();
			PRINT_INF("Launching App 1.");
			// De-initialize bootloader hardware & peripherals
			SD_DeInit();
			GPIO_DeInit();
			// Launch application 
			Bootloader_JumpToApp1();
		}
	}
*/
/*
	// Recover from backup app
	while( !app1_available && app2_available ){
		
		Copy_App2_To_App1();
		
		if(Bootloader_CheckForApp1() == BL_OK){
	#if(USE_CHECKSUM)
			// Verify application checksum 
			if(Bootloader_IsApp1ChecksumValid() == BL_OK){
				app1_available = true;
				PRINT_RAW("Launching App 1.\r\n");
				SD_DeInit();
				GPIO_DeInit();
				// Launch application 
				Bootloader_JumpToApp1();
			}
	#endif
		}else{
			PRINT_RAW("Failed to recover, retry.\r\n");
		}
		HAL_Delay(2000);
	}
*/

	// Launch app 1
	if( app1_available && !app2_available ){
		PRINT_RAW("Launching App 1.\r\n");
		SD_DeInit();
		GPIO_DeInit();
		// Launch application 
		Bootloader_JumpToApp1();
	}
	
    // No application found
    PRINT_INF("No application in flash.");
    while(1){
        setAllPixelColor( 20,20,20 );
        HAL_Delay(150);
        setAllPixelColor( 0,0,0 );
        HAL_Delay(150);
    }
}

/*** Bootloader ***************************************************************/

void Enter_Bootloader(void)
{
//    FRESULT  res;
//    UINT     num;
//    uint8_t  i;
//    uint8_t  status;
//    uint64_t data;
//    uint32_t cntr;
//    uint32_t addr;
//    char     msg[40] = {0x00};

//    /* Check for flash write protection */
//    if(Bootloader_GetProtectionStatus() & BL_PROTECTION_WRP)
//    {
//        PRINT_INF("Application space in flash is write protected.");
//        PRINT_INF("Press button to disable flash write protection...");
//        LED_R_ON();
//        for(i = 0; i < 100; ++i)
//        {
//            LED_Y_TG();
//            HAL_Delay(50);
//            if(IS_BTN_PRESSED())
//            {
//                PRINT_INF("Disabling write protection and generating system "
//                      "reset...");
//                Bootloader_ConfigProtection(BL_PROTECTION_NONE);
//            }
//        }
//        LED_R_OFF();
//        LED_Y_OFF();
//        PRINT_INF("Button was not pressed, write protection is still active.");
//        PRINT_INF("Exiting Bootloader.");
//        return;
//    }

//    /* Initialize SD card */
//    if(SD_Init())
//    {
//        /* SD init failed */
//        PRINT_INF("SD card cannot be initialized.");
//        return;
//    }

